local broadCodes = {}
_G.broadCodes = broadCodes

broadCodes.status = {
	"[КОД 1] Всем постам код 1, поддерживать командный пункт (Выносить приговор по усмотрению, тревога)",
	"[КОД 2] Всем постам код 2 (Оружие в руках, приготовиться к сдерживанию!)",
	"[КОД 3] Отрядам поддержки код 3 (Опасность не подтверждена, ожидайте!)",
	"[КОД 3 и 4] У нас 3 и 4",
	"[КОД 4] Ситуация под контролем, отбой тревоге",
	"[КОД 4A] Ситуация не под контролем, сотрудники прибыли на место",
	"[КОД 4N] Подкрепления не требуются, доказательств преступления не найдено",
	"[КОД 5] Ведётся слежка",
	"[КОД 6] Покинул службу для расследования",
	"[КОД 12] Вернуться к патрулированию",
	"[КОД 77] Возможно засада",
	"[КОД 100] Все чисто",
}
broadCodes.other = {
	"[КОД 63] Причинение вреда",
	"[КОД 69] Акты сексуального характера",
	"[КОД 69A] Попытка размножения",
	"[КОД 187] Убийство",
	"[КОД 187C] Труп",
	"[КОД 211] Ограбление",
	"[КОД 211А] Попытка ограбления",
	"[КОД 245] Нападение с летальным исходом",
	"[КОД 390] Пьяница",
	"[КОД 404] Нарушитель",
	"[КОД 415] Нарушение общественного порядка",
	"[КОД 505] Объект вооружен огнестрельным оружием",
	"[КОД 505М] Объект вооружен оружием ближнего боя",
	"[КОД 505S] Выстрелы",
	"[КОД 594] Вандализм",
	"[КОД 647E] Сопротивление",
	"[КОД 904] Самоубийство",
	"[КОД 904А] Попытка самоубийства",
	"[КОД 996] Взрыв",
	"[КОД 996Т] Угроза взрыва",
}