local gps = gps or {}
_G.gps = gps

gps.config = gps.config or {}
local cfg = gps.config

cfg.defaultIcon = "arrow_down"
cfg.defaultCategoryIcon = "map"
cfg.pointSound = "Friends/message.wav"
cfg.distanceToRemove = 500

-- cfg.points = {
--     ["Вокзал"] = {pos = Vector(1133.551758, 1043.553833, 681.813965)},
--     ["Главная площадь"] = {pos = Vector(330.927216, 871.655029, 684.964844)},
--     ["Нексус Надзора"] = {pos = Vector(316.105835, 1656.430908, 718.369507)},
--     ["Офис ГСР"] = {pos = Vector(755.980347, -384.180542, 135.835907)},
-- }
cfg.points = {
	["Важные места"] = {
		priority = 1,
		-- check = function(ply) return ply:isRebel() end,
		-- icon = "",
		list = {
			["Главная площадь"] = {
				pos = Vector(-3188.391602, 9269.948242, 3970.326416)
			},
			["Вход в цитадель"] = {
				pos = Vector(-1418.712890625, 9232.4296875, 3796.03125)
			},
			["Пункт выдачи рационов"] = {
				pos = Vector(-5288.779297, 8806.789063, 3933.864746)
			},
			["Пункт сдачи контрабанды"] = {
				pos = Vector(-7562.603027, 4629.939941, 3862.102783)
			},
			["Скупщик контрабанды"] = {
				pos = Vector(-6219.375000, 6555.067383, 3868.031250)
			},
			["Завод ГСР"] = {
				pos = Vector(-8347.661133, 3916.156982, 3896.308350)
			},
			["Больница ГСР"] = {
				pos = Vector(-5100.8447265625, 4899.1206054688, 3804.03125)
			},
			["Рабочая зона ГСР"] = {
				pos = Vector(-6119.119140625, 6526.580078125, 3612.03125)
			},
			["Офис ГСР"] = {
				pos = Vector(-4586.991699, 4889.402832, 3863.814209)
			},
			["Музыкальный бар"] = {
				pos = Vector(-7316.1665039062, 5792.5952148438, 3867.8813476562)
			},
			["Терминал CID"] = {
				pos = Vector(-5051.042480, 10010.128906, 3946.048584)
			},
			["Вокзал"] = {
				pos = Vector(-4491.5, 9021.9345703125, 3868.03125)
			}
		}
	},
	["Жилые блоки"] = {
		priority = 2,
		list = {
			["Жилой блок A"] = {
				pos = Vector(-3423.799072, 7670.837402, 3877.325439)
			},
			["Жилой блок B"] = {
				pos = Vector(-3771.726807, 10707.548828, 3945.026611)
			},
			["Жилой блок C"] = {
				pos = Vector(-5189.051758, 7642.162109, 3943.088867)
			},
			["Жилой блок D (правый подъезд)"] = {
				pos = Vector(-4969.014160, 6176.310059, 3904.503174)
			},
			["Жилой блок D (левый подъезд)"] = {
				pos = Vector(-6422.820313, 6281.385254, 3889.750000)
			},
			["Жилой блок E"] = {
				pos = Vector(-1720.260620, 7193.572754, 4014.995117)
			},
			["Жилой блок F"] = {
				pos = Vector(-7695.960938, 4672.054688, 3882.281738)
			}
		}
	},
	["Сектора"] = {
		priority = 3,
		list = {
			["Промышленная зона"] = {
				pos = Vector(-8297.298828125, 4947.3681640625, 3858.53125)
			},
			["Сектор - D1"] = {
				pos = Vector(-4044.9526367188, 7543.2592773438, 3841.9909667969)
			},
			["Сектор - D2"] = {
				pos = Vector(-5566.2290039062, 5577.8681640625, 3858.53125)
			},
			["Сектор - D3"] = {
				pos = Vector(509.755096, 5881.090332, 3885.906250)
			},
			["Сектор - D4"] = {
				pos = Vector(-6283.563965, 7127.310059, 3902.614258)
			},
			["Сектор - D5"] = {
				pos = Vector(-3065.0166015625, 10885.418945312, 3859.5822753906)
			},
			["Сектор - D6"] = {
				pos = Vector(-2995.0163574219, 13439.852539062, 3897.0200195312)
			},
			["Сектор - D7"] = {
				pos = Vector(-1412.245483, 7500.761719, 4038.720947)
			}
		}
	},
	["Точки захвата"] = {
		check = function(ply) return ply:isRebel() or ply:isCP() or ply:Team() == TEAM_ADMIN end,
		priority = 4,
		list = {
			["КПП - D3"] = {
				pos = Vector(-551.083801, 6234.025391, 3868.031250)
			},
			["Сектор - D3"] = {
				pos = Vector(839.722900, 3739.717773, 3868.031250)
			},
			["Промзона"] = {
				pos = Vector(-9100.497070, 4883.337402, 3784.905273)
			},
			["Сектор - D6"] = {
				pos = Vector(-4065.139404, 13399.102539, 3917.360596)
			},
			["КПП - D6"] = {
				pos = Vector(-3225.366943, 12497.687500, 3823.655518)
			},
			["Цитадель"] = {
				pos = Vector(1941.771729, 9243.128906, 3823.987549)
			},
			["База сопротивния"] = {
				pos = Vector(-2015.1846923828, 10722.443359375, 2477.03125)
			},
			["База Альянса"] = {
				pos = Vector(3493.541015625, 12207.483398438, 4787.03125)
			},
		}
	},
	["Сопротивление"] = {
		check = function(ply) return ply:isRebel() or ply:Team() == TEAM_ADMIN end,
		priority = 5,
		list = {
			["База сопротивления"] = {
				pos = Vector(-1119.546875, 11578.548828125, 2516.2314453125)
			},
			["Повышение до отряда HYDRA"] = {
				pos = Vector(-1678.8707275391, 11089.471679688, 2477.03125)
			},
			["Повышение до лидеров"] = {
				pos = Vector(-1680.291015625, 10888.642578125, 2477.03125)
			},
			["Выдача формы сопротивления"] = {
				pos = Vector(-1551.2781982422, 10902.154296875, 2477.03125)
			},
			["Арсенал сопротивления"] = {
				pos = Vector(-1193.0834960938, 10887.220703125, 2477.03125)
			},
			["Медпункт сопротивления"] = {
				pos = Vector(-835.56805419922, 10803.172851562, 2477.03125)
			},
			["Зараженная зона"] = {
				pos = Vector(909.40545654297, 11583.827148438, 2570.0241699219)
			},
			["Телепорт на базе"] = {
				pos = Vector(-2688.6098632812, 10574.592773438, 2481.0239257812)
			},
			["Скупщик оружия"] = {
				pos = Vector(567.937500, 7734.847656, 2701.031250)
			},
			["Телепорт в лаборатории"] = {
				pos = Vector(-11614.895507812, 5773.3305664062, 3865.03125)
			}
		}
	},
	["Беглецы"] = {
		check = function(ply) return ply:isRefugee() end,
		priority = 5,
		list = {
			["Зараженная зона"] = {
				pos = Vector(909.40545654297, 11583.827148438, 2570.0241699219)
			},
			["Скупщик оружия"] = {
				pos = Vector(567.937500, 7734.847656, 2701.031250)
			},
		}
	},
	["Альянс"] = {
		check = function(ply) return ply:isCP() or ply:Team() == TEAM_ADMIN end,
		priority = 6,
		list = {
			["Столовая"] = {
				pos = Vector(-275.23785400391, 9795.498046875, 3796.03125)
			},
			["Медпункт"] = {
				pos = Vector(1652.8901367188, 7276.6284179688, 3796.03125)
			},
			["Стазисная"] = {
				pos = Vector(1506.46875, 7435.2451171875, 5332.03125)
			},
			["Арсенал ГО"] = {
				pos = Vector(1224.2033691406, 7252.04296875, 3796.03125)
			},
			["Командование"] = {
				pos = Vector(1250.46875, 12082.1640625, 5332.03125)
			},
			["Кабинет АЗ"] = {
				pos = Vector(2668.3779296875, 10142.720703125, 7376.03125)
			},
			["Допросная ГО"] = {
				pos = Vector(1505.8012695312, 7877.3798828125, 3796.03125)
			},
			["Допросная ТБ"] = {
				pos = Vector(2527.53125, 10183.469726562, 3803.53125)
			},
			["Тюремный блок"] = {
				pos = Vector(2844.5986328125, 10299.65625, 3796.03125)
			},
			["КПП - Вокзал"] = {
				pos = Vector(-6472.140625, 10167.247070312, 3740.03125)
			},
			["Утилизация контрабанды"] = {
				pos = Vector(3495.8686523438,10022.970703125,3796.03125)
			},
			["Плац"] = {
				pos = Vector(255.68435668945, 9762.5859375, 3796.03125)
			}
		}
	},
	["Терминалы с уязвимостями"] = {
		check = function(ply) return ply:Team() == TEAM_AGENT or ply:Team() == TEAM_ADMIN end,
		priority = 7,
		list = {
			["Терминал 1 уровня - Легкий"] = {
				pos = Vector(-6940.489258, 5858.472168, 3804.321777)
			},
			["Терминал 2 уровня - Средний"] = {
				pos = Vector(-3805.965820, 6793.654297, 4121.297852)
			},
			["Терминал 3 уровня - Тяжелый"] = {
				pos = Vector(2364.942627, 8925.519531, 8144.494629)
			}
		}
	},
}

cfg.pointsList = {}
for category, categoryData in pairs(cfg.points) do
	local categoryList = categoryData.list
	for pointName, pointData in pairs(categoryList) do
		cfg.pointsList[pointName] = {
			category = category,
			pointData = pointData
		}
	end
end

--[[
    Не трогать
--]]
local dist = cfg.distanceToRemove
cfg.distanceToRemove = dist * dist
