DarkRP.Zones = DarkRP.Zones or {}
local Zones = DarkRP.Zones
Zones.List = Zones.List or {}

local meta = FindMetaTable("Player")
function Zones.GetZone(pos)
	for name, tbl in pairs(Zones.List) do
		for i = 1, #tbl.pos, 2 do
			if pos:WithinAABox(tbl.pos[i], tbl.pos[i + 1]) then return name, tbl end
		end
	end
	return "Неизвестно", {
		name = "Неизвестно",
		pos = {Vector(), Vector()}
	}
end

function meta:GetZone()
	return self:GetNetVar("Zone.Active", "Неизвестно")
end

function meta:GetPrevZone()
	return self:GetNetVar("Zone.Old", self:GetZone())
end

function meta:GetNiceZone()
	local zone, old = self:GetZone(), self:GetPrevZone()
	return zone == "Неизвестно" and old or zone
end

local function AddZone(name, poses, show)
	for i = 1, #poses, 2 do
		OrderVectors(poses[i], poses[i + 1])
	end

	Zones.List[name] = {
		name = name,
		pos = poses,
		show = show
	}
end

AddZone("Админ зона", {Vector(-5065, 6910, 7399), Vector(-2586, 8736, 5478)}, true)
AddZone("Зона для ивентов", {Vector(6120, -1776, 7618), Vector(14120, 8224, 10512)}, true)
AddZone("JAIL", {Vector(-9322, 10085, 2964), Vector(-10089, 10532, 3379)}, true)

do -- ВОКЗАЛ
	AddZone("Зона прибытия", {
		Vector(-8818, 8335.5, 3699.5), Vector(-6120, 9504.5, 4568.5),
	}, true)
	AddZone("Зона хранения багажа", {
		Vector(-7272, 7863, 3740), Vector(-6120, 8335, 4092),
	}, true)
	AddZone("Зона досмотра багажа", {
		Vector(-7912.5, 9512, 3699.5), Vector(-6095.5, 10360, 4568.5),
		Vector(-6842, 10360, 3699.5), Vector(-6376, 10568, 4568.5),
	}, true)
	AddZone("Зона управления вокзала", {
		Vector(-8763, 10567, 3699.5), Vector(-6223, 11197, 4568.5),
	}, true)
	AddZone("Коридор к допросным", {
		Vector(-6376.5, 10371, 3700), Vector(-5687.5, 10495, 4030),
	}, true)
	AddZone("Допросная вокзала", {
		Vector(-6104.5, 10595, 3700), Vector(-5567.5, 10815, 4028),
	}, true)
	AddZone("Складское помещение охраны", {
		Vector(-6223, 10831, 3700), Vector(-5567, 11159, 4028),
	}, true)
	AddZone("Задний двор вокзала", {
		Vector(-5551, 10880, 3700), Vector(-5303, 11328, 4212),
	}, true)
	AddZone("Подсобка вокзала", {
		Vector(-5551, 10360, 3700), Vector(-4911, 10880, 4212),
	}, true)
	AddZone("Проходная зона вокзала", {
		Vector(-6095, 9600, 3700), Vector(-4719, 10360, 4212),
	}, true)
	AddZone("Холл вокзала", {
		Vector(-5455, 8439.5, 3700), Vector(-4375, 9600.5, 4830),
	}, true)
	AddZone("Техническое помещение вокзала", {
		Vector(-6106.5, 7832.5, 3700), Vector(-4855.5, 8439.5, 4212),
	}, true)
end

do -- ЦИТАДЕЛЬ
	AddZone("Ядро", {
		Vector(2219, 11517.5, 3982.5), Vector(3629, 12654.5, 5829.5),
	}, true)

	AddZone("Проход к ядру", {
		Vector(953.5, 12497, 5331.5), Vector(2250.5, 13045, 5828.5),
		Vector(1280.5, 13045.5, 4787), Vector(3263.5, 13716.5, 5829),
		Vector(-100.5, 9837.5, 5283.5), Vector(1840.5, 11854.5, 5828.5),
	}, true)

	AddZone("Комната командования", {
		Vector(1277, 11918.5, 5331.5), Vector(1959, 12265.5, 5828.5),
	}, true)

	AddZone("Главный зал", {
		Vector(607.5, 9128, 5332), Vector(1148.5, 9352, 5556),
		Vector(1149, 8135.5, 4013), Vector(2173, 9928.5, 7121),
		Vector(483, 8134.5, 3795.5), Vector(2173, 9617.5, 4012.5),
	}, true)

	AddZone("Плац", {
		Vector(-63, 9638.5, 3795.5), Vector(743, 9977.5, 4012.5),
	}, true)

	AddZone("Столовая", {
		Vector(-893, 9638.5, 3796), Vector(-129, 10009.5, 4052),
	}, true)

	AddZone("Зал собраний", {
		Vector(359.5, 10231.5, 3732), Vector(1028.5, 10864.5, 4052),
	}, true)

	AddZone("Холл Цитадели", {
		Vector(-1063.5, 8085, 3796), Vector(-444.5, 9039, 4404),
		Vector(-434.5, 8436.5, 3796), Vector(456.5, 9335.5, 4404),
	}, true)

	AddZone("Вход в Цитадель", {
		Vector(-1309, 9044.5, 3795.5), Vector(-445, 9407.5, 4012.5),
	}, true)

	AddZone("Тюремный блок", {
		Vector(2624, 9814, 3796), Vector(3608, 11028, 4198),
	}, true)

	AddZone("Тренировочный полигон", {
		Vector(2611.5, 6879.5, 3797), Vector(3604.5, 8868.5, 4319),
	}, true)

	AddZone("Допросная 1", {
		Vector(2352.123535, 10575.882812, 3923.968750), Vector(2600.736084, 10039.270508, 3807.280762),
	}, true)

	AddZone("Допросная 2", {
		Vector(1158.378662, 7927.589844, 3923.968750), Vector(1532.793701, 7608.270020, 3796.031250),
	}, true)

	AddZone("Оружейная ГО", {
		Vector(1158.147095, 6907.198242, 3959.968750), Vector(1528.794556, 7326.838379, 3796.031250),
	}, true)

	AddZone("Медицинский блок", {
		Vector(1545.251221, 7326.779297, 3796.031250), Vector(1912.640503, 6760.292480, 4067.968750),
	}, true)

	AddZone("Казармы ГО", {
		Vector(2575.566650, 6176.423828, 3796.031250), Vector(1946.049072, 7542.827637, 3959.968750),
	}, true)

	AddZone("Стазисная", {
		Vector(1093.321655, 7935.668945, 5332.031250), Vector(1500.141968, 7280.919922, 5588.968750),
	}, true)

	AddZone("Оружейная СЧОПА", {
		Vector(1093.100098, 6823.087402, 5523.968750), Vector(1500.625244, 7271.636719, 5332.031250),
	}, true)

	AddZone("Проход к стазисной", {
		Vector(1548.5, 6877, 5332), Vector(2763.5, 8123, 5588),
	}, true)

	AddZone("Проход на 3 этаж", {
		Vector(2237.091064, 9344.226562, 5332.031250), Vector(2475.760254, 10767.726562, 5507.968750),
	}, true)

	AddZone("Цитадель - 3 этаж", {
		Vector(766, 10232, 7376), Vector(3292, 10776, 8068),
		Vector(2218.5, 10056.5, 7375.5), Vector(2617.5, 10231.5, 8068.5),
	}, true)

	AddZone("Кабинет АЗ", {
		Vector(2644.5, 9286, 7376), Vector(3291.5, 10110, 8068),
	}, true)

	AddZone("Трансляционная", {
		Vector(2604.788818, 8951.789062, 8112.031250), Vector(2093.260986, 8664.227539, 8591.968750),
	}, true)
end

do -- ГОРОД
	AddZone("Главная площадь", {
		Vector(-4359, 7872, 3795.5), Vector(-3619, 8128, 4844.5),
		Vector(-2895, 7488, 3795.5), Vector(-2369, 8128, 4844.5),
		Vector(-3287, 10352, 3795.5), Vector(-2345, 10442, 4844.5),
		Vector(-4359, 10322, 3795.5), Vector(-2345, 10352, 4844.5),
		Vector(-4359, 8128, 3795.5), Vector(-1309, 10322, 4844.5),
	}, true)
	AddZone("Жилой блок A", {
		Vector(-3619, 7104, 3804), Vector(-3107, 8120, 4444),
		Vector(-3843, 7466, 3804), Vector(-3619, 7872, 3932),
		Vector(-3843, 7135.5, 4059.5), Vector(-3619, 7872.5, 4444.5),
		Vector(-3107, 7320, 3804), Vector(-2725, 7488, 3916),
	}, true)
	AddZone("Жилой блок B", {
		Vector(-3827, 10480, 3804), Vector(-3283, 11072, 4260),
		Vector(-3827, 10368, 4000), Vector(-3407, 10480, 4260),
		Vector(-3723, 10368, 3804), Vector(-3407, 10480, 4000),
	}, true)
	AddZone("Жилой блок C", {
		Vector(-4253, 7296, 4186), Vector(-5343, 7818, 3868),
	}, true)
	AddZone("Жилой блок D", {
		Vector(-6695, 5968, 3804), Vector(-5207, 6456, 4316),
		Vector(-5925.5, 6456, 3804), Vector(-5274.5, 6928, 4316),
		Vector(-5237.5, 6198, 3804), Vector(-5078.5, 6456, 4442),
		Vector(-5079, 6094, 3804), Vector(-4783, 6456, 4442),
		Vector(-6635, 6456.5, 3804), Vector(-6335, 6775.5, 4316),
	}, true)
	AddZone("Жилой блок D - Крыша", {
		Vector(-6844.5, 5976, 4336), Vector(-5855.5, 6464, 4596),
	}, true)
	AddZone("Жилой блок D - Подвал", {
		Vector(-7160, 5960, 3476), Vector(-5104, 6864, 3784),
	}, true)
	AddZone("Жилой блок F", {
		Vector(-8005.5, 4176, 3800), Vector(-7510.5, 4768, 4046),
	}, true)
	AddZone("Жилой блок E", {
		Vector(-1822, 6936, 3940), Vector(-1050, 7310, 4316),
	}, true)
	AddZone("Музыкальный бар", {
		Vector(-7584, 7160, 3808), Vector(-7026, 7340, 4028),
		Vector(-7170, 5840, 3808), Vector(-7000, 7160, 4028),
		Vector(-8576, 5840, 3808), Vector(-7170, 7160, 4028),
	}, true)
	AddZone("Завод ГСР - Задний двор", {
		Vector(-8654, 3722, 3736), Vector(-8018, 4022, 4844),
		Vector(-10054, 3722.5, 3736), Vector(-8654, 4273.5, 4844),
	}, true)
	AddZone("Завод ГСР - Чердак", {
		Vector(-8655, 4020.5, 4188), Vector(-8015, 4775.5, 4844),
	}, true)
end

do -- СЕКТОРА
	AddZone("Старый завод", {
		Vector(-11455, 5448, 3736.5), Vector(-10575, 5704, 4567.5),
		Vector(-10191, 5448, 3736.5), Vector(-9955, 5592, 4567.5),
		Vector(-11455, 4836, 3736.5), Vector(-9541, 5448, 4567.5),
	}, true)
	AddZone("Промышленная зона - Допросная", {
		Vector(-9543, 5718, 3864), Vector(-9207, 5944, 3928),
	}, true)
	AddZone("Промышленная зона", {
		Vector(-9551, 4776, 3736), Vector(-9207, 5448, 4844),
		Vector(-10054, 4272.5, 3736), Vector(-8654, 4835.5, 4844),
		Vector(-9207.5, 1751, 3736), Vector(-6976.5, 8855, 4844),
		Vector(-8653.5, 4454.5, 3796), Vector(-8562.5, 4561.5, 4188),
		Vector(-8653.5, 4552, 3796), Vector(-8498.5, 4776, 4188),
		Vector(-8399.5, 4672.5, 3796), Vector(-8144.5, 4775.5, 4188),
	}, true)
	AddZone("Старый завод - Чердак", {
		Vector(-9871, 5512, 4320), Vector(-9615, 5592, 4568),
		Vector(-10031, 5592, 4320), Vector(-9551, 5936, 4568),
	}, true)
	AddZone("Старый завод - 3 Этаж", {
		Vector(-10575, 5448, 4184), Vector(-10191, 5592, 4292),
		Vector(-9935, 5448, 4184), Vector(-9551, 5592, 4292),
		Vector(-10615, 5592, 4184), Vector(-9541, 6144, 4292),
	}, true)
	AddZone("Старый завод - 2 Этаж", {
		Vector(-11447, 5720, 3928.5), Vector(-10063, 5936, 4055.5),
		Vector(-11985, 5938, 3865), Vector(-10063, 6582, 4113),
	}, true)
	AddZone("Старый завод - 1 Этаж", {
		Vector(-9919, 5464, 3800), Vector(-9551, 5920, 3928),
		Vector(-10207, 5592, 3800), Vector(-9940, 5768, 3928),
		Vector(-10559, 5464, 3800), Vector(-10207, 5768, 3928),
	}, true)
	AddZone("Старый завод - Гараж", {
		Vector(-11447, 5720.5, 3800.5), Vector(-10575, 5943.5, 3919.5),
	}, true)
	AddZone("Старый завод - Цокольный этаж", {
		Vector(-10615, 5576, 3544), Vector(-9801, 6144, 3688),
	}, true)
	AddZone("Старый завод - Обвалы", {
		Vector(-11713.5, 5522, 3736), Vector(-11470.5, 6248, 3856),
	}, true)
	AddZone("Сектор D7", {
		Vector(-2192, 6933, 3939.5), Vector(-1830, 7317, 4636.5),
		Vector(-2192, 7316.5, 3787.5), Vector(-958, 7871.5, 4636.5),
		Vector(-1042, 6933, 4087.5), Vector(-958, 7317, 4936.5),
	}, true)
	AddZone("D6", {
		Vector(-3255, 12523.5, 3803.5), Vector(-1597, 16364.5, 4440.5),
		Vector(-4603.5, 14317.5, 3803.5), Vector(-3252.5, 15474.5, 4440.5),
	}, true)
	AddZone("Сектор - D6", {
		Vector(-5359, 12542, 3804), Vector(-3255, 14318, 4488),
	}, true)
	AddZone("КПП - D6", {
		Vector(-4189, 11853.5, 3804), Vector(-3589, 11938.5, 3932),
		Vector(-3588.5, 11776, 3804), Vector(-3099.5, 11938, 3932),
		Vector(-4189, 11938, 3803.5), Vector(-2747, 12524, 4440.5),
	}, true)
	AddZone("Сектор D5-D6", {
		Vector(-3717, 11617, 3804), Vector(-3589, 11837, 3932),
		Vector(-3588.5, 11416, 3804), Vector(-2811.5, 11760, 3932),
		Vector(-3100.5, 11760, 3804), Vector(-2811.5, 11922, 3932),
	}, true)
	AddZone("КПП - D5", {
		Vector(-3279, 10486, 3796.5), Vector(-2455, 11072, 4835.5),
		Vector(-3893.5, 10486, 4261), Vector(-3278.5, 11072, 4609),
	}, true)
	AddZone("Сектор D-5", {
		Vector(-3279, 11072, 3795.5), Vector(-2455, 11408, 4608.5),
		Vector(-3725, 11072, 3795.5), Vector(-3279, 11200, 4608.5),
		Vector(-3725, 11200.5, 3795.5), Vector(-3597, 11609.5, 4608.5),
	}, true)
	AddZone("Сектор - D4", {
		Vector(-5267, 6464, 3804), Vector(-4849, 7328, 4444),
		Vector(-6839, 6936, 3804), Vector(-5267, 7616, 4444),
		Vector(-6839.5, 6784, 3804), Vector(-5948.5, 6936, 4444),
	}, true)
	AddZone("Сектор - D2", {
		Vector(-4879.5, 5164, 3804), Vector(-2854.5, 5320, 4844),
		Vector(-5904, 5064, 3804), Vector(-4880, 5320, 4844),
		Vector(-6975.5, 5320, 3804), Vector(-2854.5, 5832, 4844),
		Vector(-5200, 5832, 3804), Vector(-5006, 6080, 4844),
		Vector(-6846, 5832, 3804), Vector(-5198, 5952, 4844),
		Vector(-6992, 5832, 3804), Vector(-6846, 6344, 4844),
	}, true)
	AddZone("Сектор - D1-D2", {
		Vector(-3773.5, 5872.5, 3795.5), Vector(-3462.5, 6111.5, 4844.5),
		Vector(-4243, 6112, 3795.5), Vector(-3087, 6900, 4844.5),
	}, true)
	AddZone("Сектор - D1", {
		Vector(-4243, 6900, 3795.5), Vector(-3853, 7872, 4844.5),
	}, true)
	AddZone("Мусоросборник", {
		Vector(-3246.5, 4698, 3804), Vector(-2905.5, 5164, 4844),
	}, true)
	AddZone("Промышленная зона", {
		Vector(-8399.5, 4672.5, 3796), Vector(-8144.5, 4775.5, 4188),
		Vector(-8653.5, 4552, 3796), Vector(-8398.5, 4776, 4188),
		Vector(-8653.5, 4464.5, 3796), Vector(-8562.5, 4551.5, 4188),
		Vector(-10054, 4272.5, 3736), Vector(-8654, 4835.5, 4844),
		Vector(-9551.5, 4776, 3736), Vector(-6976.5, 5830, 4844),
	}, true)
	AddZone("Лаборатория Сопротивления", {
		Vector(-12439, 5072.5, 3864.5), Vector(-11471, 5799.5, 4127.5),
	}, true)
	AddZone("Крыша КПП - D2", {
		Vector(-2826.5, 6096, 4388.5), Vector(-1965.5, 6879.5, 4599.5),
	}, true)
	AddZone("КПП - D2", {
		Vector(-2854, 5320, 3804), Vector(-2110, 6112, 4844),
	}, true)
	AddZone("ОПГО КПП - D2", {
		Vector(-2853.5, 6119.5, 3804.5), Vector(-1990.5, 6688.5, 3951.5),
	}, true)
end

do -- ГСР
	AddZone("Больница ГСР", {
		Vector(-4971.5, 4560, 3804), Vector(-4870.5, 4844, 4052),
		Vector(-5775.5, 4560, 3804), Vector(-4982.5, 5064, 4052),
	}, true)
	AddZone("Офис ГСР", {
		Vector(-4872, 4560, 3804), Vector(-4388, 5096, 4180),
		Vector(-4778, 5096, 3804), Vector(-4388, 5192, 4180),
	}, true)
	AddZone("Крыши - ГСР", {
		Vector(-5792, 4638, 4346), Vector(-4388, 5064, 4844),
	}, true)
end

do -- ТОРГОВЫЕ ТОЧКИ
	AddZone("Магазин с витриной", {
		Vector(-3099, 7496, 3804), Vector(-2911, 8124, 3932),
	}, true)
	AddZone("Магазин на углу ГП", {
		Vector(-4210, 10338, 3788), Vector(-3890, 10774, 3940),
	}, true)
	AddZone("Магазин с окошком в ЖБ A", {
		Vector(-3843, 7104, 3804), Vector(-3619, 7466, 3932),
	}, true)
	AddZone("Магазин с окошком в ЖБ Б", {
		Vector(-4985, 5832, 3804), Vector(-4759, 6080, 3924),
	}, true)
end

do -- ЗАПРЕТНЫЙ СЕКТОР
	AddZone("Руины", {
		Vector(-2110, 4494, 3292.5), Vector(-1342, 7088, 3803.5),
		Vector(-1982, 4493.5, 3804), Vector(-1342, 6486.5, 4316),
		Vector(-2110, 5064, 3804), Vector(-1982, 6112, 4316),
	}, true)

	AddZone("КПП - D3", {
		Vector(-1342, 4494, 3804), Vector(-702, 6834, 4316),
		Vector(-702, 5186, 3804), Vector(450, 6776, 4316),
	}, true)

	AddZone("Сектор - D3", {
		Vector(450, 4634, 3804), Vector(1602, 6136, 4316),
	}, true)

	AddZone("Опорный пункт - D3", {
		Vector(821, 2688, 3452), Vector(1571, 3312, 3804),
		Vector(-140, 2798, 3804), Vector(1610, 4634, 4316),
	}, true)

	AddZone("Изолированный двор", {
		Vector(100, 1632, 3868), Vector(1060, 2624, 4220),
	}, true)

	AddZone("Разрушенный туннель", {
		Vector(1040, 4032, 3416), Vector(2212, 6016, 3676),
		Vector(1572, 1264, 3480), Vector(2212, 3312, 3676),
	}, true)

	AddZone("Просвет", {
		Vector(1444, 3312, 3416), Vector(2212, 4032, 3676),
	}, true)

	AddZone("Верхние каналы", {
		Vector(98, 11424, 3045), Vector(790, 12024, 3573),
		Vector(-679, 9575.5, 2973), Vector(263, 11424.5, 3173),
		Vector(-678.5, 8471, 2972), Vector(162.5, 9575, 3106),
		Vector(-47, 8016.5, 2972), Vector(263, 8471.5, 3106),
		Vector(-200.5, 8034, 3133.5), Vector(258.5, 9030, 3292.5),
		Vector(-1533, 8784, 3133.5), Vector(-201, 9030, 3516.5),
		Vector(-1455.5, 7854, 3324), Vector(-1112.5, 8784, 3444),
		Vector(-1455.5, 7634, 3324), Vector(-944.5, 7854, 3444),
		Vector(-944.5, 6832, 3324), Vector(-719.5, 7854, 3624),
		Vector(-1175.5, 5514, 3452), Vector(-824.5, 6832, 3624),
	}, true)

	AddZone("Коллектор", {
		Vector(258, 8560.5, 3296), Vector(610, 8723.5, 3494),
		Vector(258, 7703.5, 429.5), Vector(610, 8560.5, 3494.5),
	}, true)

	AddZone("Нижние каналы", {
		Vector(-3149.5, 12762, 2452.5), Vector(-2706.5, 13046, 2999.5),
		Vector(-3222.5, 13046.5, 2452.5), Vector(-549.5, 15141.5, 2999.5),
		Vector(-245, 14122, 2452.5), Vector(691, 14736, 2999.5),
		Vector(691, 12740.5, 2452.5), Vector(921, 14735.5, 2999.5),
		Vector(330.5, 11840, 2452.5), Vector(637.5, 13222, 2999.5),
		Vector(675, 5928.5, 2700.5), Vector(1085, 11455.5, 3039.5),
		Vector(422.5, 8592, 2700.5), Vector(685.5, 9312, 3039.5),
		Vector(690, 8784, 3040), Vector(882, 9168, 3150),
	}, true)

	AddZone("Cточный канал", {
		Vector(601.5, 11840, 2452.5), Vector(1094.5, 12086, 2999.5),
		Vector(-413.5, 11455.5, 2477), Vector(1373.5, 11840.5, 3005),
	}, true)

	AddZone("База повстанцев", {
		Vector(-3516, 12199, 2024), Vector(-1526, 12711, 2870),
		Vector(-3516, 11841, 2024), Vector(-962, 12200, 2870),
		Vector(-3516, 9519.5, 2024), Vector(-478, 11840.5, 2870),
		Vector(-477.5, 9520, 2024), Vector(-414.5, 11498, 2870),
	}, true)

	AddZone("Газовый узел", {
		Vector(-704, 11904, 2328), Vector(112, 12720, 3144),
		Vector(-1838, 12358, 2451.5), Vector(-704, 13028, 3144),
	}, true)

	AddZone("Техническая зона", {
		Vector(331.5, 13260, 2452.5), Vector(524.5, 13782, 2999.5),
		Vector(-524.5, 13003, 2452.5), Vector(332.5, 14043, 2999.5),
	}, true)

	AddZone("Водосток", {
		Vector(-2767, 14352, 3381.5), Vector(-1735, 16200, 3586.5),
	}, true)

	AddZone("Проход к туннелю", {
		Vector(-708, 6384, 3452), Vector(-8, 7136, 3624),
		Vector(-8, 6384, 3452), Vector(924, 6648, 3624),
	}, true)
end